{
  "from": "sarah",
  "to": ["fulton"],
  "cc": ["quinn", "gotan"],
  "subject": "AF PROD promotion confirmed. Vercel AF_ENABLED=false. CORS verification needed for cutover.",
  "ticket": "TIEMPO-329",
  "priority": "high",
  "timestamp": "2026-01-30T21:30:00.000Z",
  "type": "status-update",
  "body": "Fulton,\n\nConfirming AF v1.20.1 is promoted to PROD. Vercel PROD has NEXT_PUBLIC_AF_ENABLED=false — no cutover yet. Users are still on Express. AF PROD is parked and ready.\n\n## CORS Verification Needed\n\nBefore we can flip AF_ENABLED=true on PROD, we need to confirm CORS is configured on AF PROD for these origins:\n\n1. https://tangotiempo.com\n2. https://www.tangotiempo.com\n3. https://test.tangotiempo.com (Vercel preview)\n4. http://localhost:3001 (local dev)\n\nCan you verify what's currently set in AF PROD CORS config? This was flagged in your original PROD readiness audit as a hardening gap. If CORS is wrong, every FE call fails on cutover day.\n\nAlso: the 11 unprotected write endpoints you identified — can you confirm which ones require Firebase Bearer auth on Express? If Express requires auth and AF doesn't, that's a security regression we need to close before cutover.\n\n## FE Side — What's Queued for PROD\n\nWe have a 29-commit delta from PROD (v1.15.0) to DEVL (v1.16.0). Key items beyond the migration code:\n\n### Bug Fixes (ship-worthy independent of AF cutover)\n- RRULE crash fix: FullCalendar rrule exdate timeZoneOffset crash — Date objects vs ISO strings\n- RRULE null check: Safer recurring event parsing with null/invalid date filtering\n- Event creation fixes: Time reset on venue select, mobile save button hidden, exclude dates not captured\n- Activity logger disabled (frontend-logs endpoint returns 400)\n\n### AF Migration Code\n- apiUrlResolver.js — central URL routing based on AF_ENABLED flag\n- 28 files migrated to use apiUrlResolver\n- SSR pages updated with correct import paths\n- Health polling circuit breaker (stops after 3 failures)\n- Dead code cleanup (LocationLogger, useMasteredCities, useLocationPrompt removed)\n\n### Infrastructure\n- Node.js engine upgrade 20.x to 22.x (LTS)\n- Re-enabled tracking with reduced console noise\n\nThe bug fixes (especially RRULE) should go to PROD regardless of AF cutover. El Gotan and I will handle the FE deployment.\n\nIf there's any disagreement on PROD decisions, Quinn and El Gotan are the arbitrators.\n\n## SNR\n\n- S — AF v1.20.1 on PROD, Vercel AF_ENABLED=false. PROD is safe. Cutover blocked on CORS verification, auth parity check, and FE deployment.\n- N — Fulton verifies CORS + auth parity. Sarah deploys FE to PROD (bug fixes first, migration code second). Reconvene for cutover go/no-go.\n- R — Awaiting Fulton's CORS and auth verification.\n\n— Sarah"
}
