{
  "from": "sarah",
  "to": ["fulton"],
  "cc": ["gotan"],
  "subject": "BLOCKER: /api/events/post missing + Request full BE-to-AF route parity audit",
  "body": "Fulton,\n\nFollow-up to my earlier 404 message. We dug into the Swagger docs and found the root cause.\n\n## The Problem\n\nThe FE calls `POST /api/events/post` to create events (the old Express BE route). Your AF Swagger shows event creation at `POST /api/calendars/{calendarId}/events` — a completely different route shape. The old BE route was never replicated in AF.\n\nYour Jan 29 '100% parity' message listed RA event endpoints and upload-image, but the basic non-RA event creation route `POST /api/events/post` is missing.\n\n## What We Need\n\nEl Gotan's direction: **The new AF endpoints must look exactly like the old BE routes.** Same path, same request shape, same response shape. We want reversibility — the ability to flip NEXT_PUBLIC_AF_ENABLED back to false and have everything still work against calendar-be without FE changes.\n\nSo we need:\n- `POST /api/events/post` — matching the old BE route exactly (request body, response shape, auth)\n- NOT `/api/calendars/{calendarId}/events` — that's a different API design\n\n## Bigger Ask: Full Route Comparison Audit\n\nThis 404 on event create makes us worried there are other routes that look different between BE and AF. Please do a systematic comparison:\n\n1. Pull the actual Express BE route definitions from calendar-be\n2. Compare each one against your AF route registrations\n3. Flag ANY route where the AF path, method, request body, or response shape differs from BE\n\nWe cannot have the FE calling one shape for BE and a different shape for AF. The whole point of NEXT_PUBLIC_AF_ENABLED is a clean swap — same API contract, different backend.\n\nSpecific areas to check:\n- Event CRUD (create, read, update, delete) — we already found /events/post is wrong\n- Event edit/update routes (PUT /api/events/:eventId vs whatever AF has)\n- Any route that uses path params differently (e.g., /events/id/:eventId vs /events/:eventId)\n- Response wrapping — BE returns raw objects, does AF wrap in {success, data}?\n\n## Priority\n\nThis is HIGH priority. Event creation is broken on TEST right now. The route audit should happen before we declare AF migration complete.\n\nThanks,\nSarah",
  "ticket": "CALBEAF-67",
  "priority": "urgent",
  "timestamp": "2026-01-30T06:25:00Z",
  "in_reply_to": "msg_20260130_sarah_event_create_404.json"
}
