{
  "from": "sarah",
  "to": ["fulton"],
  "subject": "TIEMPO-360: masteredCity assignment chain is broken in BEAF",
  "priority": "high",
  "timestamp": "2026-02-04T",
  "ticket": "TIEMPO-360",
  "body": "Hey Fulton,\n\nEl Gotan flagged this -- events need the nearest masteredCity reliably assigned. Did a full audit across both backends. Here's the picture:\n\n## The Chain That Should Exist\nVenue has lat/lng → nearest masteredCity assigned to Venue → Event created/updated with venueID → Event inherits masteredCityId + masteredCityGeolocation FROM venue's masteredCity\n\n## What's Actually Happening\n\n### GAP 1: BEAF regular Events.js does NO mastered location population\nBoth eventsCreateHandler (line ~776) and eventsUpdateHandler (line ~913) just do `...requestBody` passthrough. No venue lookup, no masteredCityId assignment. The frontend doesn't send these fields, so events created via BEAF regular path have no masteredCityId.\n\nThe RA paths (EventsRA.js) DO copy masteredCityId from venue -- only the regular Events.js handlers are missing it.\n\n### GAP 2: masteredCityGeolocation is NEVER set -- anywhere\nNo create or update path in either BE or BEAF ever populates masteredCityGeolocation. There's an incorrect comment in raEventRoutes.js (line 231) saying 'masteredCityGeolocation will be populated by the event model' but no such model logic exists. The pre-validate hook only fills in Boston fallback coords when the field already exists with empty coordinates -- it doesn't create the field.\n\nThis breaks the event density/summary endpoint which uses masteredCityGeolocation.coordinates as a fallback when venueGeolocation is missing.\n\n### GAP 3: Venue → masteredCity assignment\nDo venues reliably have masteredCityId assigned? If a venue is created with just lat/lng, does anything find the nearest masteredCity and assign it? This is the first link in the chain.\n\n## Recommended Fix (BEAF)\n\n### 1. Venue create/update\nWhen a venue is created or updated with lat/lng, find the nearest masteredCity (geo query on masteredcities collection) and assign masteredCityId to the venue.\n\n### 2. Event create/update (Events.js regular handlers)\nSame as what EventsRA.js already does:\n- Fetch the venue by venueID\n- Copy masteredCityId, masteredDivisionId, masteredRegionId from venue\n- Copy venueGeolocation from venue.geolocation\n- NEW: Look up the masteredCity by masteredCityId and set masteredCityGeolocation from city.location\n\n### 3. Event RA create/update (EventsRA.js)\nAdd the masteredCityGeolocation population step (lookup masteredCity, copy city.location to event.masteredCityGeolocation).\n\nThis is important for the density map (TIEMPO-360) since the cluster aggregation uses masteredCityGeolocation as a fallback coordinate source.\n\nAlso a heads-up: BEAF TEST appears to be returning 500s across multiple endpoints (events, venues, health, mapcenter-track). Might be related to the recent canDrillDown deployment.\n\nThanks!\n- Sarah"
}
