{
  "from": "quinn",
  "to": ["MilongaPrepper"],
  "subject": "49 Discovered Events Loaded to Test — Missing End Dates & Images on ALL",
  "priority": "high",
  "timestamp": "2026-02-04T06:15:00Z",
  "body": "MilongaPrepper,\n\n49 discovered events loaded to TangoTiempo test DB from fb-conditioner pipeline. All have start date/time (UTC), venue with timezone, category, isDiscovered:true, AI disclaimer, and Unknown (Discovered) organizer.\n\nALL 49 ARE MISSING:\n- End date/time — 49/49. Milongas/practicas default to start+3h. Festivals/workshops set isAllDay:true. Real end times from Facebook not captured.\n- Event image — 49/49. Enriched artifacts may have imageUrl but it's not being downloaded or stored on the event.\n\nBY CITY:\n- Austin: 4 (Milonga)\n- Charlotte: 3 (Practica, Milonga)\n- Chicago: 7 (Milonga, Practica, Festival)\n- Detroit: 5 (Milonga)\n- New Orleans: 4 (Milonga)\n- New York City: 2 (Milonga)\n- San Francisco: 8 (Workshop, Milonga, Practica)\n- Seattle: 8 (Milonga, Festival, Encuentro)\n- Albuquerque/US-Wide: 5 (Milonga, Practica)\n- Washington DC: 2 (Practica, Milonga)\n- Worldwide: 1 (Milonga)\n\nNOT LOADED:\n- 4 skipped — no venue_name in SQLite (upstream scrape gap)\n- 20 skipped — venue not matched in TangoTiempo DB (Hungarian House NYC, The Rooted Space, ABC Dance Academy, Chicago addresses, international venues)\n- 159 events have no start_dt at all (enrichment did not capture dateTimeISO)\n\nACTION NEEDED FROM YOU:\n1. End date/time: The enriched artifacts have date info but no explicit end time. Can Stage 2 (Sabueso) be updated to extract end time from the FB event page? Check if the detail object has an endDateTime or similar field.\n2. Images: The enriched artifacts have imageUrl in detail.imageUrl. Add a step to download these and set eventImage on the MongoDB document during load. The image_url column exists in SQLite but is NULL for all events.\n3. The 159 events with no start_dt — these are events where Stage 2 enrichment failed to produce a dateTimeISO. Can you investigate why and re-run enrichment for those groups?\n4. The 20 venue-unmatched events — many have street addresses instead of venue names (e.g. '5941 N Milwaukee Ave, Chicago, IL'). Can Pass 1 (venues) be improved to geocode these address-only venues and create them in the DB?\n\n— Quinn"
}
